'''
Редитељ велике филмске продукције жели да зна да ли ће буџет који му је додељен бити довољан за снимање филма.
Помозите му тако што ћете написати програм који израчунава колико ће га коштати снимање филма,
знајући колико кошта један дан снимања. Цена за један дан је одређена сезоном и дестинацијом:

Постоје следећи порези/олакшице:
 Ако је дестинација Дубаи – 30% попуста од укупне цене
 Ако је дестинација Вашингтон – цена се повећава за 25%

Улазни подаци
Учитати 4 реда из конзоле:
1. Буџет филма – број са покретним зарезом у опсегу [100 000,0… 2 000 000,0]
2. Дестинација – текст, може бити „Дубаи“, „Вашингтон“ и „Лондон“
3. Сезона – текст, може бити „Лето“ или „Зима“
4. Број дана – цео број у опсегу [1… 40]

Излазни подаци
Исписати један ред у конзолу:
 Ако је буџет довољан:
„Буџет за филм је довољан! Остало нам је {преостали буџет} УСД!“
 Ако буџет НИЈЕ довољан:
„Директору је потребно још {потребна сума} УСД!“
Форматирајте резултат на другу цифру после децималног зареза.
'''

budzet = float(input())
destinacija = input()
sezona = input()
broj_dana = int(input())

# Провера улазних података
if not (100000.0 <= budzet <= 2000000.0):
    print("Неисправан унос буџета!")
    exit()
if broj_dana < 1 or broj_dana > 40:
    print("Неисправан број дана!")
    exit()
if destinacija not in ["Дубаи", "Вашингтон", "Лондон"]:
    print("Неисправна дестинација!")
    exit()
if sezona not in ["Лето", "Зима"]:
    print("Неисправна сезона!")
    exit()

cena_po_danu = 0
if sezona == "Зима":
    if destinacija == "Дубаи":
        cena_po_danu = 45000
    elif destinacija == "Вашингтон":
        cena_po_danu = 17000
    elif destinacija == "Лондон":
        cena_po_danu = 24000
elif sezona == "Лето":
    if destinacija == "Дубаи":
        cena_po_danu = 40000
    elif destinacija == "Вашингтон":
        cena_po_danu = 12500
    elif destinacija == "Лондон":
        cena_po_danu = 20250

ukupno_cena = broj_dana * cena_po_danu

# Попуст за Дубаи - 30%
if destinacija == "Дубаи":
    ukupno_cena *= 0.7

# Повећање цене за Вашингтон - 25%
if destinacija == "Вашингтон":
    ukupno_cena *= 1.25

if ukupno_cena <= budzet:
    print(f"Буџет за филм је довољан! Остало нам је {(budzet-ukupno_cena):.2f} УСД!")
else:
    print(f"Директору је потребно још {(ukupno_cena-budzet):.2f} УСД!")
